<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;
use App\Models\Product;

class ProductSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
		Product::truncate();

		$products = [
            [
				'name' => "لپ تاپ اچ پی",
				'price' => "39570000",
				'description' => "اچ‌پی در پیکره‌بندی این لپ‌تاپ از جدید‌ترین نسل پردازنده‌ مرکزی قدرتمند شرکت اینتل، یعنی مدل Core i7 11370H با حافظه کش 12 مگابایت، پردازشگر گرافیکی GeForce RTX 3050 انویدیا با 4 گیگابایت حافظه‌ی GDDR6 اختصاصی و 16 گیگابایت رم از نوع DDR4 استفاده کرده است",
				'short_description' => 'لپ تاپ 15.6 اینچی اچ‌پی مدل Pavilion Gaming 15 DK2044-A',
				'category' => "لپ تاپ",
				'gallery' => '/images/1.jpg',
            ],

            [
				'name' => "لپ تاپ ایسر",
				'price' => "76422000",
				'description' => "این لپ‌تاپ 2.3 کیلوگرم وزن دارد و از پردازنده AMD بهره می‌برد. مدل این پردازنده 5900HX است. مقدار رمی که برای این لپ تاپ درنظر گرفته شده است 32 گیگابایت از نوع DDR4 خواهد بود. حافظه داخلی ازنوع SSD بوده و یک ترابایت ظرفیت دارد.",
				'short_description' => 'لپ تاپ 15.6 اینچی ایسر مدل Nitro 5 AN515-45-R6WC',
				'category' => "لپ تاپ",
				'gallery' => '/images/2.jpg',
            ],

            [
				'name' => "لپ تاپ لنوو",
				'price' => "3490000",
				'description' => "بدون شک «لنوو» ازجمله شرکت‌هایی است که در طراحی و ساخت لپ‌تاپ‌های میان‌رده و اقتصادی تبحر خاصی دارد و تاکنون مدل‌های بسیاری را در این رده تولید کرده است. مدل‌ «IdeaPad L340» هم از‌جمله همین محصولات محسوب می‌شود.",
				'short_description' => ' لپ تاپ 15.6 اینچی لنوو مدل IdeaPad L340-R16',
				'category' => "لپ تاپ",
				'gallery' => '/images/3.jpg',
            ],

            [
				'name' => "لپ تاپ 13 اینچی اپل",
				'price' => "44690000",
				'description' => " مک‌بوک ایر نخستین لپ‌تاپ اپل با پردازنده‌ی مبتنی‌بر ARM کوپرتینونشین‌ها موسوم به M1 خواهد بود.همان‌طور که انتظار می‌رفت مک‌بوک ایر به‌لحاظ ظاهر و طراحی هیچ تفاوتی با نسخه‌ی اینتل ندارد و همانند گذشته است",
				'short_description' => 'لپ تاپ 13 اینچی اپل مدل MacBook Air MGN63 2020',
				'category' => "لپ تاپ",
				'gallery' => '/images/4.jpg',
            ],
			
			[
				'name' => "گوشی موبایل سامسونگ",
				'price' => "32700000",
				'description' => "گوشی موبایل سامسونگ مدل Galaxy Note20 Ultra 5G SM-N986 دو سیم کارت ظرفیت 256 گیگابایت یکی از شگفت‌انگیزترین گوشی‌های کمپانی بزرگ سامسونگ است که با رونمایی آن، همه افرادی که از طرفداران سامسونگ هستند را شگفت‌زده کرده است.",
				'short_description' => 'گوشی موبایل سامسونگ مدل Galaxy Note 20 Ultra 5G SM-N986 دو سیم کارت ظرفیت 256 گیگابایت',
				'category' => "موبایل",
				'gallery' => '/images/5.jpg',
            ], 
			
			[
				'name' => "گوشی موبایل اپل ",
				'price' => "55752000",
				'description' => "آیفون 13 پرو مکس در چهار مدل با حافظه‌‌های داخلی 128/256/512 گیگابایت در کنار مدل جدید با حافظه‌داخلی 1 ترابایت معرفی شد.",
				'short_description' => 'گوشی موبایل اپل مدل iPhone 13 Pro Max A2644 دو سیم‌ کارت ظرفیت 256 گیگابایت و رم 6 گیگابایت',
				'category' => "موبایل",
				'gallery' => '/images/6.jpg',
            ],

			[
				'name' => "گوشی موبایل شیائومی",
				'price' => "34800000",
				'description' => "شیائومی Mi 11 Ultra M2102K1C یکی از قدرتمند‌ترین گوشی‌های هوشمند این شرکت است که در جایگاه یک گوشی پرچمدار، توانایی ارائه عملکرد بسیار خوبی را دارد. این گوشی به صفحه‌نمایش با ابعاد 6.81 اینچ و رزولوشن 1440×3200 پیکسل از نوع AMOLED مجهز شده است. ",
				'short_description' => 'گوشی موبایل شیائومی مدل Mi 11 Ultra M2102K1C دو سیم کارت ظرفیت 512 گیگابایت و رم 12 گیگابایت',
				'category' => "موبایل",
				'gallery' => '/images/7.jpg',
            ],
			
			[
				'name' => "گوشی موبایل سامسونگ",
				'price' => "35500000",
				'description' => "سامسونگ Galaxy S22 Ultra 5G با بهره بردن از مشخصات فنی مناسب و فوق قدرتمند به‌عنوان پرچمدار شرکت سامسونگ در تاریخ 9 فوریه سال 2022 معرفی شد",
				'short_description' => 'گوشی موبایل سامسونگ مدل Galaxy S22 Ultra 5G دو سیم کارت ظرفیت 512 گیگابایت و رم 12 گیگابایت',
				'category' => "موبایل",
				'gallery' => '/images/8.jpg',
            ]
        ];

        foreach ($products as $product) {
			Product::create($product);
		}
    }
}
